### Deployment Results :white_check_mark:

 **GrantBirki** successfully **noop** deployed branch `GrantBirki-patch-1` to **production**





<details><summary>Show Results</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # cloudflare_record.api has changed
  ~ resource "cloudflare_record" "api" {
        id              = "5a6f0c44f89893d479067808915a429f"
      ~ modified_on     = "2024-07-03T16:09:43.964251Z" -> "2024-08-19T19:34:23.445923Z"
        name            = "api"
      ~ type            = "CNAME" -> "A"
      ~ value           = "api.hideout-api.workers.dev" -> "135.148.120.117"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # cloudflare_record.dev_api has changed
  ~ resource "cloudflare_record" "dev_api" {
        id              = "74b67d1043f9099b4ee38d467d24c3c2"
      ~ modified_on     = "2024-07-02T15:35:41.683206Z" -> "2024-08-19T19:34:31.86966Z"
        name            = "dev-api"
        # (10 unchanged attributes hidden)
    }

  # cloudflare_record.market has been deleted
  - resource "cloudflare_record" "market" {
      - allow_overwrite = false -> null
      - created_on      = "2022-03-31T14:32:21.117719Z" -> null
      - hostname        = "market.tarkov.dev" -> null
      - id              = "c0e350a380953cdff74f16c911b3c595" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2022-06-24T03:35:46.829464Z" -> null
      - name            = "market" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "209.151.146.50" -> null
      - zone_id         = "a17204c79af55fcf05e4975f66e2490e" -> null
    }

  # cloudflare_record.socket has been deleted
  - resource "cloudflare_record" "socket" {
      - allow_overwrite = false -> null
      - created_on      = "2022-04-01T03:35:58.878738Z" -> null
      - hostname        = "socket.tarkov.dev" -> null
      - id              = "98b363905c2efdf7a730dc754d7a680f" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2022-08-27T16:48:39.31236Z" -> null
      - name            = "socket" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "tarkov-socket-server-production.up.railway.app" -> null
      - zone_id         = "a17204c79af55fcf05e4975f66e2490e" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.api must be replaced
-/+ resource "cloudflare_record" "api" {
      ~ created_on      = "2022-03-20T23:46:39.59752Z" -> (known after apply)
      ~ hostname        = "api.tarkov.dev" -> (known after apply)
      ~ id              = "5a6f0c44f89893d479067808915a429f" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
      ~ modified_on     = "2024-08-19T19:34:23.445923Z" -> (known after apply)
        name            = "api"
      ~ proxiable       = true -> (known after apply)
      ~ type            = "A" -> "CNAME" # forces replacement
      ~ value           = "135.148.120.117" -> "api.hideout-api.workers.dev"
        # (4 unchanged attributes hidden)

      - timeouts {}
    }

  # cloudflare_record.market will be created
  + resource "cloudflare_record" "market" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "market"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "209.151.146.50"
      + zone_id         = "a17204c79af55fcf05e4975f66e2490e"
    }

  # cloudflare_record.socket will be created
  + resource "cloudflare_record" "socket" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "socket"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "tarkov-socket-server-production.up.railway.app"
      + zone_id         = "a17204c79af55fcf05e4975f66e2490e"
    }

Plan: 3 to add, 0 to change, 1 to destroy.

```

</details>
